#pragma once
#include "Common.h"

//=====================================================================================================================
// enums:
//=====================================================================================================================
enum class EGame_State : unsigned char
{
	Title,
	Play,
	End_Game,
};
//=====================================================================================================================
// AsGame_State header
//=====================================================================================================================
class AsGame_State
{
public:
	//оператор преобразования типа
	operator EGame_State() const;
	//оператор присвоения
	void operator = (EGame_State new_state);
	//P.S. оператор присваивания может возращать тип что присовил если записать так
	//EGame_State operator = (EGame_State new_state);

	~AsGame_State();
	AsGame_State();

private:
	EGame_State Game_State;
};